### Documentation of Pandas is [here](https://pandas.pydata.org/docs/user_guide/10min.html)

In [2]:
# importing libraries 
import numpy as np
import pandas as pd

## Series is a datatype(data structure) used in Pandas for data manipulation

### passing object as argument

In [3]:
first_series = pd.Series(list('abcdef'))  # passing list as argument

In [4]:
first_series  # index assigned automatically

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

### passing List as argument

In [5]:
np_names = np.array(['nitin','somi','yash','anji','rhea','ujjawal'])   # ndarray for names

In [6]:
np_names_series = pd.Series(np_names)

In [7]:
np_names_series

0      nitin
1       somi
2       yash
3       anji
4       rhea
5    ujjawal
dtype: object

### passing dictionary as argument

In [8]:
dict_country_gdp = pd.Series([2255.225482,629.9553062,11601.63022,25306.82494,27266.40335,19466.99052,588.3691778,2890.345675,24733.62696,1445.760002,4803.398244,2618.876037,590.4521124,665.7982328,7122.938458,2639.54156,3362.4656,15378.16704,30860.12808,2579.115607,6525.541272,229.6769525,2242.689259,27570.4852,23016.84778,1334.646773,402.6953275,6047.200797,394.1156638,385.5793827,1414.072488,5745.981529,837.7464011,1206.991065,27715.52837,18937.24998,39578.07441,478.2194906,16684.21278,279.2204061,5345.213415,6288.25324,1908.304416,274.8728621,14646.42094,40034.85063,672.1547506,3359.517402,36152.66676,3054.727742,33529.83052,3825.093781,15428.32098,33630.24604,39170.41371,2699.123242,21058.43643,28272.40661,37691.02733,9581.05659,5671.912202,757.4009286,347.7456605],index=['Algeria','Angola','Argentina','Australia','Austria','Bahamas','Bangladesh','Belarus','Belgium','Bhutan','Brazil','Bulgaria','Cambodia','Cameroon','Chile','China','Colombia','Cyprus','Denmark','El Salvador','Estonia','Ethiopia','Fiji','Finland','France','Georgia','Ghana','Grenada','Guinea','Haiti','Honduras','Hungary','India','Indonesia','Ireland','Italy','Japan','Kenya', 'South Korea','Liberia','Malaysia','Mexico', 'Morocco','Nepal','New Zealand','Norway','Pakistan', 'Peru','Qatar','Russia','Singapore','South Africa','Spain','Sweden','Switzerland','Thailand', 'United Arab Emirates','United Kingdom','United States','Uruguay','Venezuela','Vietnam','Zimbabwe'])

In [9]:
dict_country_gdp

Algeria           2255.225482
Angola             629.955306
Argentina        11601.630220
Australia        25306.824940
Austria          27266.403350
                     ...
United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
Length: 63, dtype: float64

### passing scalar as argument

In [10]:
scalar_series = pd.Series(5.,index=['a','b','c','d','e'])

In [11]:
scalar_series

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

### Accessing elements in Series

In [12]:
dict_country_gdp[0]    # using index no

2255.225482

In [13]:
dict_country_gdp[0:5]   # using range of index numbers

Algeria       2255.225482
Angola         629.955306
Argentina    11601.630220
Australia    25306.824940
Austria      27266.403350
dtype: float64

In [14]:
dict_country_gdp[4:9]   # using range of index nos from any index

Austria       27266.403350
Bahamas       19466.990520
Bangladesh      588.369178
Belarus        2890.345675
Belgium       24733.626960
dtype: float64

In [15]:
dict_country_gdp.loc['India']   # using name of country

837.7464011

In [16]:
dict_country_gdp.iloc[0]    # using position

2255.225482

### vectorized operations in Series

In [19]:
first_vector_series = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
second_vector_series = pd.Series([10,20,30,40,50],index=['a','b','c','d','e'])

In [20]:
first_vector_series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [21]:
second_vector_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [22]:
first_vector_series + second_vector_series

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [23]:
first_vector_series = pd.Series([1,2,3,4,5],index=['e','c','b','d','a'])

In [24]:
first_vector_series + second_vector_series

a    15
b    23
c    32
d    44
e    51
dtype: int64

In [25]:
first_vector_series = pd.Series([1,2,3,4,5],index=['e','c','b','f','g'])

In [26]:
first_vector_series + second_vector_series

a     NaN
b    23.0
c    32.0
d     NaN
e    51.0
f     NaN
g     NaN
dtype: float64

## Dataframes - another data structure

### Create dataframe from lists

In [27]:
import pandas as pd

In [117]:
# last 5 olympic date,place,year and no of countries participated

olympic_data_list = {'Hostcity':['London','Beijing','Athens','Sydney','Atlanta'], 'Year':[2021,2008,2004,2000,1996],
                    'No of participating countries':[205,204,201,200,197]}

In [118]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [119]:
df_olympic_data

  Hostcity  Year  No of participating countries
0   London  2021                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197

### Create dataframe from dictionary

In [120]:
olympic_data_dict = {'London':{2021:205},'Beijing':{2008:204}}

In [121]:
df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

In [122]:
df_olympic_data_dict

      London  Beijing
2021   205.0      NaN
2008     NaN    204.0

### View dataframe

In [34]:
df_olympic_data.Hostcity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: Hostcity, dtype: object

In [35]:
df_olympic_data.describe

<bound method NDFrame.describe of   Hostcity  Year  No of participating countries
0   London  2021                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197>

### Create dataframe from dict of series

In [36]:
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                  index=[2012,2008,2004,2000,1996])

In [37]:
df_olympic_series = pd.DataFrame({'No of participating Countries':olympic_series_participation,'Host Countries':olympic_series_country})

In [38]:
df_olympic_series

      No of participating Countries Host Countries
2012                            205         London
2008                            204        Beijing
2004                            201         Athens
2000                            200         Sydney
1996                            197        Atlanta

### Create dataframe from ndarray

In [39]:
import numpy as np

In [40]:
np_array = np.array([2012,2008,2004,2000,1996])
dict_ndarray = {'Year': np_array}

In [41]:
df_ndarray = pd.DataFrame(dict_ndarray)

In [42]:
df_ndarray

   Year
0  2012
1  2008
2  2004
3  2000
4  1996

### Create dataframe from dataframe object

In [43]:
df_from_df = pd.DataFrame(df_olympic_series)

In [44]:
df_from_df

      No of participating Countries Host Countries
2012                            205         London
2008                            204        Beijing
2004                            201         Athens
2000                            200         Sydney
1996                            197        Atlanta

## View and Select data in Pandas

In [45]:
# import libraries
import numpy as np
import pandas as pd

In [46]:
# create dataframe from dict of series for summer olympics : 1996 - 2012
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                  index=[2012,2008,2004,2000,1996])

df_olympic_series = pd.DataFrame({'No of participating Countries':olympic_series_participation,'Host Cities':olympic_series_country})

In [47]:
# Display content of the dataset
df_olympic_series

      No of participating Countries Host Cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [48]:
# view dataframe describe
df_olympic_series.describe

<bound method NDFrame.describe of       No of participating Countries Host Cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta>

In [49]:
# view top 2 records
df_olympic_series.head(2)

      No of participating Countries Host Cities
2012                            205      London
2008                            204     Beijing

In [50]:
# view last 3 records
df_olympic_series.tail(3)

      No of participating Countries Host Cities
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [51]:
# view indexes of datasets
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [52]:
# view columns of dataset
df_olympic_series.columns

Index(['No of participating Countries', 'Host Cities'], dtype='object')

### Select data

In [53]:
# select data for host city
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [54]:
# Another data selection no. of participating countries
df_olympic_series['No of participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No of participating Countries, dtype: int64

In [55]:
# Select label-location based access by label
df_olympic_series.loc[2012]

No of participating Countries       205
Host Cities                      London
Name: 2012, dtype: object

In [56]:
# integer-location based indexing by position
df_olympic_series.iloc[0:2]

      No of participating Countries Host Cities
2012                            205      London
2008                            204     Beijing

In [57]:
# integer-location based data selection by index value
df_olympic_series.iat[3, 1]

'Sydney'

In [58]:
# select data element by condition where number of participated countries are more than 200 
# HINT - Use boolean expression
df_olympic_series[df_olympic_series['No of participating Countries'] == 200]

      No of participating Countries Host Cities
2000                            200      Sydney

## Handling missing values

In [59]:
first_series = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [60]:
second_series = pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])

In [61]:
sum_of_series = first_series + second_series

In [62]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [63]:
# drop NaN (Not a Number) value from dataset
dropna_s = sum_of_series.dropna()

In [64]:
dropna_s

c    13.0
e    25.0
dtype: float64

In [65]:
# Fill NaN (Not a Number) values from dataset with zeroes
fillna_s = sum_of_series.fillna(0)

In [66]:
fillna_s

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [67]:
# fill NaN with zeroes before performing addition operation for missing indices
fill_NaN_with_zeroes_before_sum = first_series.add(second_series, fill_value=0)

In [68]:
fill_NaN_with_zeroes_before_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

## Data Operations

In [69]:
import pandas as pd

In [70]:
# declare movie rating dataframe: ratings from 1 to 5 (star * rating)
df_movie_rating = pd.DataFrame({'movie 1':[5,4,3,3,2,1],'movie 2':[4,5,2,3,4,2]},index=['Tom','Jeffer','Peter','Ram','Ted','Paul'])

In [71]:
df_movie_rating

        movie 1  movie 2
Tom           5        4
Jeffer        4        5
Peter         3        2
Ram           3        3
Ted           2        4
Paul          1        2

In [72]:
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    if rating==2:
        return 'D'
    if rating==1:
        return 'E'
    else:
        return 'F'

In [73]:
print(movie_grade(5))

A

In [74]:
df_movie_rating.applymap(movie_grade)

       movie 1 movie 2
Tom          A       B
Jeffer       B       A
Peter        C       D
Ram          C       C
Ted          D       B
Paul         E       D

## Data operations with statistical functions

In [75]:
import pandas as pd

In [76]:
df_test_scores = pd.DataFrame({'Test1':[95,84,73,88,82,61], 'Test2':[74,85,82,73,77,79]}, index=['Jack','Lewis','Patrick','Rich','Kelly','Paula'])

In [77]:
df_test_scores.max()   # max function to find maximum score

Test1    95
Test2    85
dtype: int64

In [78]:
df_test_scores.mean()   # mean function to find mean of both of them

Test1    80.500000
Test2    78.333333
dtype: float64

In [79]:
df_test_scores.std()    # std function to find standard deviation

Test1    11.979149
Test2     4.633213
dtype: float64

### groupby function to operate data

In [80]:
df_president_names = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],'last':['Bush','Clinton','Regan','Carter','Washington']})

# create datafrae with president names

In [81]:
df_president_names

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [82]:
first_only = df_president_names.groupby('first')

In [83]:
first_only.get_group('George')

    first        last
0  George        Bush
4  George  Washington

In [84]:
df_president_names.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

### How to stadardise our dataset

In [85]:
def standardize_tests(test):   # create funtion to standardize value
    return (test-test.mean())/test.std()

In [86]:
standardize_tests(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [87]:
def standardize_test_scores(dataframe):    # apply function to entire dataset
    return dataframe.apply(standardize_tests)

In [88]:
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

## Pandas Data Operation - Merge, Duplicate & Concatenation

In [89]:
# import required libraries
import pandas as pd

In [90]:
# define student data with math data
df_student_math = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],'ID':[10,56,31,85,9,22]})

In [91]:
# define student data from science data
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],'ID':[10,12,22]})

In [92]:
# merge both data to form single dataframe with math & science data
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

In [93]:
# merge with key on student
pd.merge(df_student_math,df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [94]:
# merge left join on key ID & also fill NaN values with x
pd.merge(df_student_math,df_student_science, on='ID',how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [95]:
# concat data of both subjects
pd.concat([df_student_math, df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [96]:
# define new data frame with student survey data
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],'ID':[10,56,10,85,9,56]})

In [97]:
# view the dataframe
df_student_survey_data

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [98]:
# check for duplicate data
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [99]:
# drop duplicate values with student as key
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [100]:
# drop duplicate values with ID as key
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

## Pandas SQL operations

In [101]:
import pandas as pd
import sqlite3

In [102]:
# Create SQL table
create_table = """CREATE TABLE student_score(Id INTEGER, Name VARCHAR(20),Math REAL,Science REAL);"""

In [103]:
# Execute SQL statement
execute_SQL = sqlite3.connect(':memory:')
execute_SQL.execute(create_table)
execute_SQL.commit()

In [104]:
# prepare SQL query
SQL_query = execute_SQL.execute('select * from student_score')

In [105]:
# fetch result from sqlite database
resultset = SQL_query.fetchall()

In [106]:
# view result (empty data)
resultset

[]

### Prepare records in SQL using Pandas

In [107]:
# Prepare records to be inserted into SQL table through SQL statement
insertSQL = [(10,'Jack',85,92),(29,'Tom',73,89),(65,'Ram',65.5,77),(5,'Steve',55,91)]

In [108]:
# Insert records through SQL statement into SQL table
insert_statement = "Insert into student_score values (?,?,?,?)"
execute_SQL.executemany(insert_statement, insertSQL)

In [109]:
# PRepare SQL query
SQL_query = execute_SQL.execute("select * from student_score")

In [110]:
# Fetch resultant for the query
resultset = SQL_query.fetchall()

In [111]:
# View the resultant
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [112]:
# Put records into a dataframe
df_student_records = pd.DataFrame(resultset, columns=list(zip(*SQL_query.description))[0])

In [113]:
# view data in dataframe
df_student_records

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0